{
    "apple": {
      "Black rot": {
        "description": "Olmaning chirishi yoki Olmaning achchiq chirishi — bu olma mevasining zamburug'li kasalligi bo'lib, ushbu kasallik Colletotrichum acutatum va Colletotrichum gloeosporioides turlari komplekslaridagi bir nechta turlar tomonidan keltirib chiqariladi. Olma eti ichiga konussimon kirib borishi bilan hosil bo'lgan dumaloq jarohatlar bilan aniqlanadi, ular olmaning kasallangan markazi teng yarmidan kesilganda V shaklida ko'rinadi. Bu tropik hududlarda olma mevalariga keng miqyosda ziyon keltiruvchi kasalliklaridan biridir.",
        "treatment": "Birinchi narsa, xamkorlar bilan muloqot qilishni maslahat beraman. Ular sizning hududingizdagi o'lchovlar va mavqelar bo'yicha qanday muammo borligini bilishi mumkin. Keyin, quyidagi usullarni sinab ko'rishni maslahat beraman:\n1. Quruqligi yopish: Suvning urchiga qarab, obiqlik vaqtida buza oladi. Plastik yoki polietilen qog'oz bo'ylab yopish masala hal qilinishi mumkin.\n2. Rivojlanishga ko'rsatma bering: Tozalash paytida eski yoki qattiq qolgan qismlarni bartaraf qilishga intilish. Bu chiroqlar genetik asosda qolib, keyinchalik qaytadan kasallanganida ularning ko'payib ketishini oldini olish uchun juda muhim.\n3. Zichlik: Barcha o'tkir va kasallangan qismlarni tozalash uchun uning doimo o'zgaruvchan suvlar bilan tozalashni kuzatib boring. Bu navbatan buning qaytarilishini oldini olishga yordam beradi.\n4. Fungitsidlar: Fungitsidlar (chiroq killerlar) kasallikni oldini olish uchun juda samarali bo'lishi mumkin. Ularni to'g'ri yoki o'zgartirilgan dozalarda ishlatish uchun istiqomat qilish tavsiya etiladi.\n5. Qog'ozlashtirish: Meva va shifobaxsh otlarning tomchilari yoki taqsimlash ko'rgazmalarida chiroqlarning qanday yayilib qolganligini kamaytirish uchun qog'ozlashingiz mumkin."
      },
      "Scab": {
        "description": "Olma qora qo'tiri Venturia inaequalis patogenidan kelib chiqqan keng tarqalgan qo'ziqorin kasalligi. Bu, birinchi navbatda, olma daraxtlariga ta'sir qiladi, barglar, mevalar va novdalarda quyuq, yashil yoki qora dog'larni keltirib chiqaradi. Bu jarohatlar birlashib, defoliatsiyaga, meva sifatining pasayishiga va hosilning yo'qolishiga olib kelishi mumkin. Kasallik issiq, nam sharoitda, ayniqsa bahorgi yomg'ir paytida tez tarqaladi. Boshqaruv strategiyalariga chidamli olma navlarini ekish, profilaktika maqsadida qo'ziqorinlarni qo'llash, yaxshi sanitariya qoidalarini qo'llash, namlik darajasini pasaytirish va kasallik bosimini kamaytirish uchun bog'da to'g'ri havo aylanishini yo'lga qo'yishni talab qilish kiradi.",
        "treatment": "Olma qo'tiri kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Chidamli olma navlarini ekish: Chidamli olma navlarini tanlash, kasallikka qarshi suyaklarni yaratishga yordam berishi mumkin.\n2. Qo'ziqorinlarni qo'llash: Qo'ziqorinlarni kasallikning o'qarligini kamaytirish uchun qo'llash tavsiya etiladi. Fungitsidlar keng tarqalgan olma qo'tiri ko'prikli kasalliklarini oldini olish uchun samarali bo'ladi.\n3. Yaxshi sanitariya qoidalarini qo'llash: Daraxtlarni tozalash, quruqlar va barglarini bartaraf qilish, kasallikning tarqalishini oldini olishda muhim bo'ladi.\n4. Namlik darajasini pasaytirish: Daraxtlarning pastki qismida namlik darajasini pasaytirish uchun tajriba etganligi qo'llash tavsiya etiladi. Bu, kasallikning tarqalishini kamaytirishga yordam berishi mumkin.\n5. Bog'da to'g'ri havo aylanishini yo'lga qo'yish: Kasallikning tarqalishini kamaytirish uchun bog'da to'g'ri havo aylanishini ta'minlash juda muhimdir."
      },
  
      "Cedar rust": {
        "description": "“Kedr olma zanglari” qo'ziqorin kasalligi bo'lib, patogen Gymnosporangium juniperi-virginianae tomonidan chaqiriladi. Kasallik sariqdan to'q sariq ranggacha bo'lgan dog'lar yoki olma daraxtlarining barglari, mevalari va novdalaridagi shishlar shaklida namoyon bo'ladi, ko'pincha 'galls' deb ataladigan to'q sariq, jelatinli tuzilmalar bilan birga keladi. Bu gallar yaqin atrofdagi sadr daraxtlarini yuqtirishi mumkin bo'lgan sporalarni chiqaradi va kasallik tsiklini yakunlaydi. Sidr olma zanglari defoliatsiyaga, meva sifatining pasayishiga va olma bog'larida hosilning yo'qolishiga olib kelishi mumkin. Boshqaruv strategiyalari orasida chidamli olma navlarini ekish, yaqin atrofdagi sadr xostlarini olib tashlash va kasalliklarning yuqori bosimi davrida sezgir daraxtlarni himoya qilish uchun fungitsidlarni qo'llash kiradi.",
        "treatment": "Kedr olma zanglarini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Bepul ofitli uchun: Sharoitlar ko'rib chiqilganda, ofitlarni (fungitsidlar) mavjud bo'lganda, ularni chiqib tashlash kerak bo'ladi.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikga qarshi himoya qilish uchun fazilatli daraxtlar tanlash va ularga qarshi himoya qilishga intilish.\n3. Parazit oldini olish: Daraxtlarning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n4. Oziq-ovqat qo'llash: Kedr olma zanglarini davolash uchun oziq-ovqat qo'llash, masalan, manba va zang daraxtlari, juda samarali bo'ladi.\n5. Qorishlar va xalqaro tadbirlar: Qorishlar va xalqaro tadbirlar, masalan, daraxtlarni qo'llash, kichik va ko'prikli zanglarning faoliyati yoki kasallik tarqalishi paytida, juda foydali bo'ladi."
      },
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan sizning olmangizda hech qanday kasallik aniqlanmadi"
      }
    },
  
    "bell pepper": {
      "Bacterial Spot": {
        "description": "Bolgar qalampirining bakterial dog'i - bu Xanthomonas campestris pv bakteriyasi keltirib chiqaradigan keng tarqalgan o'simlik kasalligi. Bu, birinchi navbatda, qalampir o'simliklariga ta'sir qiladi, barglar, poya va mevalarda mayda, suv bilan namlangan jarohatlarga sabab bo'ladi. Bu jarohatlar ko'pincha jigarrang rangga aylanadi va nekrozga aylanadi, bu defoliatsiyaga va meva hosilining pasayishiga olib keladi. Bakteriyalar suv, shamol va ifloslangan asboblar yoki qo'llar orqali tez tarqalishi mumkin. Issiq, nam sharoitlar bakterial dog'larning rivojlanishiga yordam beradi. Boshqaruv strategiyalari kasalliklarga chidamli navlarni ekish, almashlab ekish, havo aylanishi uchun o'simliklar orasidagi to'g'ri masofani saqlash va mis asosidagi fungitsidlarni oldini olish uchun qo'llashni o'z ichiga oladi. Bundan tashqari, ortiqcha sug'orishdan qochish va yaxshi sanitariya qoidalariga rioya qilish kasallikning tarqalishini kamaytirishga yordam beradi.",
        "treatment": "Bolgar qalampiri bakteriya dog'i kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Tinchlik va sterilizatsiya: Infektsiyani oldini olish uchun daraxtni ozod qilish va ushbu kasallikning tarqalishiga sabab bo'lgan obyekt va vositalarni sterilizatsiya qilish juda muhimdir.\n2. Qulupni bartaraf qilish: Infektsiyaga uchratilgan qulupni bartaraf qilish uchun qo'g'iroqlash va qulupni zamonaviy vositalar bilan almashtirish, infektsiyani oldini olishda yordam beradi.\n3. Fungitsidlar va bakteritsidlar: Bolgar qalampiri bakteriya dog'i kasalligini oldini olish uchun fungitsidlar va bakteritsidlar (bakteriya oldini olish vositalari) ishlatish tavsiya etiladi. Ularni infektsiyaga uchratilgan vaqtda va to'g'ri dozada ishlatish kerak.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, masalan, narx va vitaminlar bilan bo'lgan tayyor vositalar, qulupning infektsiyaga qarshi to'g'ri reaksiyasini oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi."
      },
  
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan sizning bolgar qalampiringizda hech qanday kasallik aniqlanmadi"
      }
    },
  
    "cherry": {
      "Mildew": {
        "description": "Gilos changli chiriyotgan - gilos daraxtlariga ta'sir qiluvchi qo'ziqorin kasalligi. Barglar, kurtaklar va mevalarda oq, chang o'sishi bilan tavsiflanadi. Bu barglarning buzilishiga, bargning erta tushishiga, meva sifati va hosildorligining pasayishiga olib kelishi mumkin. Qo'ziqorin issiq, nam sharoitda o'sadi, lekin sovuqroq iqlimda ham tarqalishi mumkin. Davolash fungitsidlarni qo'llashni, havo aylanishini yaxshilash uchun daraxt shoxchalaridan kamaytirish va kasallikning tarqalishini oldini olish uchun infektsiyalangan daraxt shoxini olib tashlashni o'z ichiga oladi.",
        "treatment": "Gilosni changli chirishini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Fungitsidlar (chiroq killerlar) kasallikni oldini olish uchun juda samarali bo'lishi mumkin. Ularni to'g'ri dozalarda ishlatish tavsiya etiladi.\n2. Natijaviy tanab ko'rish: Ovqat muddati va qoidalariga amal qilish, tanab ko'rishni samarali davolash usuliga aylanadi.\n3. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish tavsiya etiladi.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, masalan, narx va vitaminlar bilan bo'lgan tayyor vositalar, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi."
      },
  
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan sizning gilosingizda hech qanday kasallik aniqlanmadi"
      }
    },
  
    "citrus": {
      "Black Spot": {
        "description": "Sitrus qora dog'i Guignardia citricarpa qo'zg'atuvchisi qo'zg'atadigan qo'ziqorin kasalligi. Tsitrus qora dog'i mevaning erta tushishiga, meva sifatining pasayishiga va tsitrus yetishtiruvchilar uchun iqtisodiy yo'qotishlarga olib kelishi mumkin. Kasallik shamol, yomg'ir yoki ifloslangan asbob-uskunalar tomonidan olib boriladigan sporalar orqali tarqaladi. Boshqaruv strategiyalariga fungitsidlarni qo'llash, havo aylanishini yaxshilash uchun kesish va infektsiyalangan o'simlik qismlarini olib tashlash uchun sanitariya amaliyotlari kiradi.",
        "treatment": "Sitrus qora dog'ini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Sitrus qora dog'ini oldini olish uchun fungitsidlar ishlatish tavsiya etiladi. Ularni to'g'ri dozalarda va to'g'ri paytda qo'llash juda muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikga qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, masalan, narx va vitaminlar bilan bo'lgan tayyor vositalar, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Canker": {
        "description": "Sitrus saratoni sitrus daraxtlariga ta'sir qiluvchi bakterial kasallik bo'lib, barglari, mevalari va poyalarida ko'tarilgan, po'stloq yaralar bilan tavsiflanadi. Bu defoliatsiya, meva tushishi va dog'larni keltirib chiqaradi, hosil sifatini pasaytiradi. Bakteriyalar shamol ta'sirida yomg'ir, ifloslangan asboblar yoki zararlangan o'simlik materiallari orqali tarqaladi. Boshqaruv infektsiyalangan qismlarni olib tashlash, mis asosidagi spreylarni qo'llash va tarqalishining oldini olish uchun sanitariya qoidalarini qo'llash kasallikni kamaytirish uchun yetarli bo'ladi.",
        "treatment": "Sitrus saratoni kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Infektsiyaga uchrashgan daraxtlarni qo'llash: Daraxtlarni kasallikga qarshi himoya qilish uchun infektsiyaga uchrashgan qismalarni bartaraf qilish, barglarni tozalash va infektsiyaga uchrashgan obyektlarni olib tashlash muhimdir.\n2. Fungitsidlar va bakteritsidlar: Sitrus saratoni kasalligini oldini olish uchun fungitsidlar va bakteritsidlar (bakteriya oldini olish vositalari) ishlatish tavsiya etiladi. Ularni to'g'ri dozalarda va to'g'ri paytda qo'llash juda muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, masalan, narx va vitaminlar bilan bo'lgan tayyor vositalar, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Greening": {
        "description": "Huanglongbing (HLB) sifatida ham tanilgan tsitrus ko'kalamzorlashtirish tsitrus daraxtlariga ta'sir qiluvchi halokatli bakterial kasallikdir. Bu barglarning sarg'ayishiga, meva hajmining pasayishiga va achchiq, noto'g'ri shakliga olib keladi. Osiyo sitrus psyllid deb nomlangan mayda hasharotlar tomonidan tarqalgan, HLB uchun hech qanday davo yo'q. Boshqaruv asosiy e'tiborni psyllidlarni nazorat qilish, zararlangan daraxtlarni yo'q qilish va kasalliklarga chidamli navlarni ekishga qaratadi.",
        "treatment": "Huanglongbing kasallik turini davolash uchun hozircha samarali davolash usullari mavjud emas. Biroq, quyidagi muhim chidamli hodisalar tavsiya etiladi:\n1. Daraxtlarni qo'llash: Infektsiyaga uchrashgan daraxtlarni qo'llash, infektsiyani tozalash, kasallikdan zarar ko'rgan qismalarni bartaraf qilish va infektsiyaga uchrashgan obyektlarni olib tashlash muhimdir.\n2. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, masalan, narx va vitaminlar bilan bo'lgan tayyor vositalar, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n3. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan sizning sitrusingizda hech qanday kasallik aniqlanmadi"
      }
    },
  
    "corn": {
      "Common rust": {
        "description": "makkajo'xorini keng tarqalgan zangi - bu makkajo'xori o'simliklariga ta'sir qiladigan qo'ziqorin kasalligi bo'lib, barglarda kichik, qizil-jigarrang pustulalarni keltirib chiqaradi. Bu hosil va sifatning pasayishiga olib kelishi mumkin. Boshqaruv chidamli navlarni ekish va kerak bo'lganda fungitsidlarni qo'llashni o'z ichiga oladi.",
        "treatment": "Makkajo'xorini keng tarqalgan zangini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Makkajo'xorini keng tarqalgan zangini oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Parazit oldini olish: Daraxtning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Gray leaf spot": {
        "description": "Makkajo'xori bargining kulrang dog'i makkajo'xori o'simliklariga ta'sir qiluvchi qo'ziqorin kasalligi bo'lib, barglarda kulrang lezyonlarni keltirib chiqaradi. Bu hosil va sifatning pasayishiga olib kelishi mumkin. Boshqaruv chidamli navlarni ekish va kerak bo'lganda fungitsidlarni qo'llashni o'z ichiga oladi.",
        "treatment": "Makkajo'xori bargining kulrang dog'ini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Makkajo'xori bargining kulrang dog'ini oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Parazit oldini olish: Daraxtning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Northern Leaf Blight": {
        "description": "Makkajo'xorining shimoliy barglari  zamburug'li kasallik bo'lib, makkajo'xori o'simliklariga ta'sir qiladi va barglarda cho'zilgan jarohatlarga olib keladi. Bu hosil va sifatning pasayishiga olib kelishi mumkin. Boshqaruv chidamli navlarni ekish va kerak bo'lganda fungitsidlarni qo'llashni o'z ichiga oladi.",
        "treatment": "Makkajo'xorining shimoliy zamburug'li kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Makkajo'xorining shimoliy zamburug'li kasalligini oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Parazit oldini olish: Daraxtning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan sizning makkajo'xoringizda hech qanday kasallik aniqlanmadi"
      }
    },
  
    "grape": {
      "Black Measles": {
        "description": "Qora rot deb ham ataladigan uzumning qora qizamig'i uzumzorlarga ta'sir qiluvchi qo'ziqorin kasalligi bo'lib, meva, barglar va poyalarda qorong'i, botgan jarohatlarni keltirib chiqaradi. Bu samarali boshqarilmasa, katta hosil yo'qotishiga olib kelishi mumkin. Nazorat choralari infektsiyalangan qismlarni kesish, fungitsidlardan foydalanish va uzumzorlarni yaxshi sanitariya qilishdan iborat.",
        "treatment": "Uzumning qora qizamig'ini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Uzumning qora qizamig'ini oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Parazit oldini olish: Daraxtning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Black rot": {
        "description": "Uzum chirishi - bu uzumzorlarga ta'sir qiluvchi qo'ziqorin kasalligi bo'lib, meva, barglar va poyalarda qora, cho'kib ketgan jarohatlar bilan tavsiflanadi. Bu samarali boshqarilmasa, katta hosil yo'qotishiga olib kelishi mumkin. Nazorat choralari infektsiyalangan qismlarni kesish, fungitsidlardan foydalanish va uzumzorlarni yaxshi sanitariya qilishdan iborat.",
        "treatment": "Uzumning chirishini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Uzumning chirishini oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Parazit oldini olish: Daraxtning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Isariopsis Leaf Spot": {
        "description": "Uzum antraknozi deb ham ataladigan uzum Isariopsisi uzumzorlarga ta'sir qiluvchi qo'ziqorin kasalligidir. Barglar va mevalarda jigarrang lezyonlarni keltirib chiqaradi, bu esa hosil va sifatning pasayishiga olib keladi. Nazorat choralari fungitsidlarni qo'llash va havo aylanishini oshirish uchun kesish kabi madaniy amaliyotlarni o'z ichiga oladi.",
        "treatment": "Makkajo'xorining shimoliy zamburug'li kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Makkajo'xorining shimoliy zamburug'li kasalligini oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n4. Parazit oldini olish: Daraxtning atrofida parazitlarni, masalan, kechki kuluplarni olib tashlash uchun qo'g'iroqlash.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan sizning uzumingizda hech qanday kasallik aniqlanmadi"
      }
    },
  
    "peach": {
      "Bacterial spot": {
        "description": "Shaftoli bakterial dog'i shaftoli daraxtlariga ta'sir qiluvchi kasallik bo'lib, bakteriya keltirib chiqaradi. Bu barglar va mevalarda qora dog'lar paydo bo'lishiga olib keladi, hosildorlik va sifatni pasaytiradi. Nazorat choralari infektsiyalangan qismlarni kesish va mis asosidagi fungitsidlarni qo'llashni o'z ichiga oladi.",
        "treatment": "Shaftoli bakterial dog'ini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Kasallikni oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, infektsiyaga uchrashgan qismalarni bartaraf qilish va infektsiyaga uchrashgan obyektlarni olib tashlash muhimdir.\n3. Zichlik: Barcha o'tkir va kasallangan qismlarni tozalash uchun uning doimo o'zgaruvchan suvlar bilan tozalashni kuzatib boring. Bu kasallikning tarqalishini oldini olishga yordam beradi.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Healthy": {
        "description": "Sun'iy intellekt tomonidan shaftolida hech qanday kasallik aniqlanmadi"
      }
    },
  
    "potato": {
      "Early blight": {
        "description": "Qo'ziqorin kasalligi keng tarqalgan kasallikdir, u kartoshka barglari, yumshoq qismlari va o'simlikning yuqori qismida qora yoki kulrang qizamig'larni keltiradi.Kasallik odatda aylanishning boshlang'ich martaqtir va aylanish sezoni davomida barglarda kengayishga olib keladi. Zarar keltirgan qismiyoq chiqib, bargning o'rtasidan olib chiqadi. Kasallikning kengayishi bilan kartoshka yalpi va salbiy tajribaga uchradigan vaqtida, bu og'riq, barglar yo'qligi va tuyq so'lanchi ko'rinishidagi hasarlar keltirishi mumkin.",
        "treatment": "Qo'ziqorin kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Kasallikni oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Zichlik: Barcha o'tkir va kasallangan qismlarni tozalash uchun uning doimo o'zgaruvchan suvlar bilan tozalashni kuzatib boring. Bu kasallikning tarqalishini oldini olishga yordam beradi.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Late blight": {
        "description": "Bu phytophthora infestans qo'zg'atadigan kartoshka o'simliklariga ta'sir qiluvchi halokatli qo'ziqorin kasalligi. Barglar, poyalar va ildizlarda qora, suvga botgan jarohatlar sifatida namoyon bo'ladi, bu esa barglarning tez nobud bo'lishiga va ildizlarning chirishiga olib keladi. Kechikish kasalligi samarali boshqarilmasa, hosilning sezilarli darajada yo'qotilishiga olib kelishi mumkin. Nazorat choralariga chidamli navlarni ekish, profilaktika maqsadida fungitsidlarni qo'llash va to'g'ri sug'orish va oraliqlarni joylashtirish kabi yaxshi amaliyotlarni qo'llash kiradi.",
        "treatment": "Phytophthora kasalligini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Kasallikni oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, barglarni bartaraf qilish va infektsiyaga uchrashgan qismalarni bartaraf qilish muhimdir.\n3. Zichlik: Barcha o'tkir va kasallangan qismlarni tozalash uchun uning doimo o'zgaruvchan suvlar bilan tozalashni kuzatib boring. Bu kasallikning tarqalishini oldini olishga yordam beradi.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Healthy": {
        "description": "Sizning kartoshkangizda sun'iy intellekt hech qanaqa kasallik aniqlamadi"
      }
    },
  
    "strawberry": {
      "Leaf scorch": {
        "description": "Bu qulupnay o'simliklariga ta'sir qiluvchi qo'ziqorin kasalligi bo'lib, barglarda jigarrang yoki binafsha-qizil dog'lar bilan tavsiflanadi. Bu barg nekroziga, meva hosildorligining pasayishiga va nazoratsiz qolsa o'simliklarning pasayishiga olib kelishi mumkin. Nazorat choralari kasalliklarga chidamli navlarni ekish, almashlab ekish va kerak bo'lganda fungitsidlarni qo'llashni o'z ichiga oladi.",
        "treatment": "Qulupnay barglarining kuyishini davolash uchun quyidagi usullarni tavsiya etiladi:\n1. Fungitsidlar: Kasallikni oldini olish uchun fungitsidlar (chiroq killerlar) ishlatish tavsiya etiladi. Ularni kasallikning tarqalishi paytida va to'g'ri dozalarda ishlatish muhimdir.\n2. Daraxtlarni qo'llash: Daraxtlarni kasallikka qarshi himoya qilish uchun daraxtni tozalash, infektsiyaga uchrashgan qismalarni bartaraf qilish va infektsiyaga uchrashgan obyektlarni olib tashlash muhimdir.\n3. Zichlik: Barcha o'tkir va kasallangan qismlarni tozalash uchun uning doimo o'zgaruvchan suvlar bilan tozalashni kuzatib boring. Bu kasallikning tarqalishini oldini olishga yordam beradi.\n4. Oziq-ovqat qo'llash: Daraxtning immunitetini kuchaytirish uchun oziq-ovqat qo'llash, kasallikka qarshi to'g'ri reaksiyani oshirishga yordam berishi mumkin.\n5. Qorishlar va xalqaro tadbirlar: Infektsiyaga uchrashgan daraxtlarni qo'llash, kasallik tarqalishi paytida, juda foydali bo'ladi. Bundan tashqari, infektsiyaga uchrashgan obyektlarni va vositalarni sterilizatsiya qilish ham muhimdir."
      },
  
      "Healthy": {
        "description": "Sizning qulupnayingizda sun'iy intellekt hech qanaqa kasallik aniqlamadi"
      }
    }
  }
  
